# BADS 7201 Programming for Machine Learning
## Pandas

### Series

In [103]:
import numpy as np
import pandas as pd
%config IPCompleter.greedy=True

In [2]:
labels = ['a', 'b', 'c']
alist = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a': 10, 'b': 20, 'c': 30}

In [3]:
pd.Series(alist)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=alist, index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [7]:
ser1 = pd.Series([10, 40, 15, 30], index=['BTC', 'ETH', 'XRP', 'LTC'])
ser1

BTC    10
ETH    40
XRP    15
LTC    30
dtype: int64

In [8]:
ser2 = pd.Series([14, 2, 5, 10], index=['BTC', 'IOTA', 'ETH', 'OMG'])
ser2

BTC     14
IOTA     2
ETH      5
OMG     10
dtype: int64

In [9]:
ser1 + ser2

BTC     24.0
ETH     45.0
IOTA     NaN
LTC      NaN
OMG      NaN
XRP      NaN
dtype: float64

### DataFrames

In [10]:
from numpy.random import randn
np.random.seed(131)

In [11]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [12]:
df

          W         X         Y         Z
A  0.450223  0.150862  1.583146 -1.254575
B -0.748017  0.381655 -0.792652 -0.840017
C  1.181791 -0.256431 -0.682090  1.400721
D -1.407079 -0.305105 -0.856245  0.201545
E  0.433215 -1.418507  0.034443  2.126671

In [13]:
df['X']

A    0.150862
B    0.381655
C   -0.256431
D   -0.305105
E   -1.418507
Name: X, dtype: float64

In [14]:
df[['W', 'Y']]

          W         Y
A  0.450223  1.583146
B -0.748017 -0.792652
C  1.181791 -0.682090
D -1.407079 -0.856245
E  0.433215  0.034443

In [15]:
type(df['X'])

pandas.core.series.Series

In [16]:
df['AA'] = df['X'] + df['Y']

In [17]:
df

          W         X         Y         Z        AA
A  0.450223  0.150862  1.583146 -1.254575  1.734008
B -0.748017  0.381655 -0.792652 -0.840017 -0.410997
C  1.181791 -0.256431 -0.682090  1.400721 -0.938521
D -1.407079 -0.305105 -0.856245  0.201545 -1.161349
E  0.433215 -1.418507  0.034443  2.126671 -1.384064

In [18]:
df.drop('AA', axis=1)

          W         X         Y         Z
A  0.450223  0.150862  1.583146 -1.254575
B -0.748017  0.381655 -0.792652 -0.840017
C  1.181791 -0.256431 -0.682090  1.400721
D -1.407079 -0.305105 -0.856245  0.201545
E  0.433215 -1.418507  0.034443  2.126671

In [19]:
df

          W         X         Y         Z        AA
A  0.450223  0.150862  1.583146 -1.254575  1.734008
B -0.748017  0.381655 -0.792652 -0.840017 -0.410997
C  1.181791 -0.256431 -0.682090  1.400721 -0.938521
D -1.407079 -0.305105 -0.856245  0.201545 -1.161349
E  0.433215 -1.418507  0.034443  2.126671 -1.384064

In [20]:
df.drop('AA', axis=1, inplace=True)

In [21]:
df

          W         X         Y         Z
A  0.450223  0.150862  1.583146 -1.254575
B -0.748017  0.381655 -0.792652 -0.840017
C  1.181791 -0.256431 -0.682090  1.400721
D -1.407079 -0.305105 -0.856245  0.201545
E  0.433215 -1.418507  0.034443  2.126671

In [22]:
df.drop('E', axis=0)

          W         X         Y         Z
A  0.450223  0.150862  1.583146 -1.254575
B -0.748017  0.381655 -0.792652 -0.840017
C  1.181791 -0.256431 -0.682090  1.400721
D -1.407079 -0.305105 -0.856245  0.201545

In [23]:
df.loc['A']

W    0.450223
X    0.150862
Y    1.583146
Z   -1.254575
Name: A, dtype: float64

In [24]:
df.iloc[2]

W    1.181791
X   -0.256431
Y   -0.682090
Z    1.400721
Name: C, dtype: float64

In [25]:
df.loc['B', 'X']

0.38165463820515266

In [26]:
df.loc[['A', 'B'], ['X', 'Y']]

          X         Y
A  0.150862  1.583146
B  0.381655 -0.792652

In [27]:
df

          W         X         Y         Z
A  0.450223  0.150862  1.583146 -1.254575
B -0.748017  0.381655 -0.792652 -0.840017
C  1.181791 -0.256431 -0.682090  1.400721
D -1.407079 -0.305105 -0.856245  0.201545
E  0.433215 -1.418507  0.034443  2.126671

In [28]:
df>0

       W      X      Y      Z
A   True   True   True  False
B  False   True  False  False
C   True  False  False   True
D  False  False  False   True
E   True  False   True   True

In [29]:
df[df>0]

          W         X         Y         Z
A  0.450223  0.150862  1.583146       NaN
B       NaN  0.381655       NaN       NaN
C  1.181791       NaN       NaN  1.400721
D       NaN       NaN       NaN  0.201545
E  0.433215       NaN  0.034443  2.126671

In [30]:
df[df['X']>0]

          W         X         Y         Z
A  0.450223  0.150862  1.583146 -1.254575
B -0.748017  0.381655 -0.792652 -0.840017

In [31]:
df[df['X']>0][['Y', 'X']]

          Y         X
A  1.583146  0.150862
B -0.792652  0.381655

In [32]:
df

          W         X         Y         Z
A  0.450223  0.150862  1.583146 -1.254575
B -0.748017  0.381655 -0.792652 -0.840017
C  1.181791 -0.256431 -0.682090  1.400721
D -1.407079 -0.305105 -0.856245  0.201545
E  0.433215 -1.418507  0.034443  2.126671

In [33]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.450223  0.150862  1.583146 -1.254575
1     B -0.748017  0.381655 -0.792652 -0.840017
2     C  1.181791 -0.256431 -0.682090  1.400721
3     D -1.407079 -0.305105 -0.856245  0.201545
4     E  0.433215 -1.418507  0.034443  2.126671

In [34]:
new_idx = 'BTC ETH XRP LTC IOTA'.split()

In [35]:
df['Coin'] = new_idx

In [36]:
df

          W         X         Y         Z  Coin
A  0.450223  0.150862  1.583146 -1.254575   BTC
B -0.748017  0.381655 -0.792652 -0.840017   ETH
C  1.181791 -0.256431 -0.682090  1.400721   XRP
D -1.407079 -0.305105 -0.856245  0.201545   LTC
E  0.433215 -1.418507  0.034443  2.126671  IOTA

In [37]:
df.set_index('Coin')

             W         X         Y         Z
Coin
BTC   0.450223  0.150862  1.583146 -1.254575
ETH  -0.748017  0.381655 -0.792652 -0.840017
XRP   1.181791 -0.256431 -0.682090  1.400721
LTC  -1.407079 -0.305105 -0.856245  0.201545
IOTA  0.433215 -1.418507  0.034443  2.126671

In [38]:
df

          W         X         Y         Z  Coin
A  0.450223  0.150862  1.583146 -1.254575   BTC
B -0.748017  0.381655 -0.792652 -0.840017   ETH
C  1.181791 -0.256431 -0.682090  1.400721   XRP
D -1.407079 -0.305105 -0.856245  0.201545   LTC
E  0.433215 -1.418507  0.034443  2.126671  IOTA

In [39]:
df.set_index('Coin', inplace=True)

In [40]:
df

             W         X         Y         Z
Coin
BTC   0.450223  0.150862  1.583146 -1.254575
ETH  -0.748017  0.381655 -0.792652 -0.840017
XRP   1.181791 -0.256431 -0.682090  1.400721
LTC  -1.407079 -0.305105 -0.856245  0.201545
IOTA  0.433215 -1.418507  0.034443  2.126671

In [41]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [42]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [43]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -0.774588 -0.371265
   2 -1.540397  0.246768
   3 -1.185272  0.379490
G2 1  0.215986  0.937818
   2 -0.967989  0.954366
   3 -0.412003  0.323112

In [44]:
df.loc['G1']

          A         B
1 -0.774588 -0.371265
2 -1.540397  0.246768
3 -1.185272  0.379490

In [45]:
df.loc['G1'].loc[1]

A   -0.774588
B   -0.371265
Name: 1, dtype: float64

In [46]:
df.index.names

FrozenList([None, None])

In [47]:
df.index.names = ['Group','Num']

In [48]:
df

                  A         B
Group Num
G1    1   -0.774588 -0.371265
      2   -1.540397  0.246768
      3   -1.185272  0.379490
G2    1    0.215986  0.937818
      2   -0.967989  0.954366
      3   -0.412003  0.323112

In [49]:
df.xs('G1')

            A         B
Num
1   -0.774588 -0.371265
2   -1.540397  0.246768
3   -1.185272  0.379490

In [50]:
df.xs(['G1',1])

A   -0.774588
B   -0.371265
Name: (G1, 1), dtype: float64

In [51]:
df.xs(1,level='Num')

              A         B
Group
G1    -0.774588 -0.371265
G2     0.215986  0.937818

### Missing Data

In [52]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [53]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [54]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [55]:
df.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [56]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Group By

In [61]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person': ['Sam', 'Chris', 'Amy', 'Lily', 'Carl', 'Sarah'],
        'Sales': [200, 120, 340, 124, 243, 350]}
df = pd.DataFrame(data)

In [62]:
df

  Company Person  Sales
0    GOOG    Sam    200
1    GOOG  Chris    120
2    MSFT    Amy    340
3    MSFT   Lily    124
4      FB   Carl    243
5      FB  Sarah    350

In [63]:
df.groupby('Company')

In [64]:
by_comp = df.groupby('Company')

In [65]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [66]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [67]:
df.groupby('Company').std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [68]:
df.groupby('Company').min()

        Person  Sales
Company
FB        Carl    243
GOOG     Chris    120
MSFT       Amy    124

In [69]:
df.groupby('Company').max()

        Person  Sales
Company
FB       Sarah    350
GOOG       Sam    200
MSFT      Lily    340

In [70]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [71]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [73]:
df.groupby('Company').describe().loc['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [79]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'], 'B': ['B0', 'B1', 'B2']}, index=[0, 1, 2])

In [75]:
df1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [80]:
df2 = pd.DataFrame({'A': ['A3', 'A4', 'A5'], 'B': ['B3', 'B4', 'B4']}, index=[3, 4, 5])
df2

    A   B
3  A3  B3
4  A4  B4
5  A5  B4

In [81]:
pd.concat([df1, df2])

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4
5  A5  B4

### Merging
The merge function combines DataFrames using a similar logic as joining SQL tables

In [86]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                     'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                     'C': ['C0', 'C1', 'C2'],
                     'D': ['D0', 'D1', 'D2']})

In [87]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2

In [88]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2

In [89]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

### Joining
Joining is combining the columns of two DataFrames which may potentially have different indexes into a single result DataFrame.

In [94]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']}, index=['K0', 'K1', 'K2'])
right = pd.DataFrame({'C': ['C0', 'C1', 'C2'],
                     'D': ['D0', 'D1', 'D2']}, index=['K0', 'K2', 'K3'])

In [95]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [96]:
right

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

In [97]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [98]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

In [108]:
df = pd.DataFrame({'col1': [1,2,3,4],'col2': ['BTC', 'ETH', 'BTC', 'XRP'], 'col3': [10, 500, 6, 1000]})
df.head()

   col1 col2  col3
0     1  BTC    10
1     2  ETH   500
2     3  BTC     6
3     4  XRP  1000

In [109]:
df['col2'].unique()

array(['BTC', 'ETH', 'XRP'], dtype=object)

In [110]:
df['col2'].nunique()

3

In [112]:
df_new = df[(df['col2']=='BTC') & (df['col3']>8)]
df_new

   col1 col2  col3
0     1  BTC    10

In [114]:
df['col2'].apply(len)

0    3
1    3
2    3
3    3
Name: col2, dtype: int64

In [115]:
df['col1'].sum()

10

In [116]:
del df['col1']

In [117]:
df

  col2  col3
0  BTC    10
1  ETH   500
2  BTC     6
3  XRP  1000

In [119]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [120]:
df.sort_values(by='col2')

  col2  col3
0  BTC    10
2  BTC     6
1  ETH   500
3  XRP  1000

In [121]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [122]:
df.dropna()

  col2  col3
0  BTC    10
1  ETH   500
2  BTC     6
3  XRP  1000

In [132]:
df = df.append({'col2': np.nan, 'col3': 15}, ignore_index=True)

In [133]:
df

  col2    col3
0  BTC    10.0
1  ETH   500.0
2  BTC     6.0
3  XRP  1000.0
4  NaN    15.0

In [134]:
df.fillna('IOTA')

   col2    col3
0   BTC    10.0
1   ETH   500.0
2   BTC     6.0
3   XRP  1000.0
4  IOTA    15.0

In [141]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [142]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [137]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [143]:
df = pd.read_csv('iris.csv')

In [144]:
df.head()

   sepal length  sepal width  petal length  petal width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [145]:
df.tail()

     sepal length  sepal width  petal length  petal width         species
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

In [147]:
df.to_csv('exmaple.csv', index=False)